
# State **`s3://infrahouse-aws-control-303467602807/terraform.tfstate`**
## Affected resources counts

|   Success |   🟢 Add |    Change |   🔴 Destroy |
|----------:|---------:|----------:|-------------:|
|        ✅ |        6 |         0 |            6 |
## Affected resources by action

|  Action  | Resources                                                                                           |
|:--------:|:----------------------------------------------------------------------------------------------------|
|    🟢    | `module.ci-tester["http-redirect-tester"].aws_iam_policy.pytest-permissions`                        |
|    🟢    | `module.ci-tester["http-redirect-tester"].aws_iam_policy.role-permissions`                          |
|    🟢    | `module.ci-tester["http-redirect-tester"].aws_iam_role.role-tester`                                 |
|    🟢    | `module.ci-tester["http-redirect-tester"].aws_iam_role_policy_attachment.role-admin-permissions[0]` |
|    🟢    | `module.ci-tester["http-redirect-tester"].aws_iam_role_policy_attachment.role-permissions`          |
|    🟢    | `module.ci-tester["http-redirect-tester"].aws_iam_role_policy_attachment.role-pytest-permissions`   |
|    🔴    | `module.ci-tester["http-redirect"].aws_iam_policy.pytest-permissions`                               |
|    🔴    | `module.ci-tester["http-redirect"].aws_iam_policy.role-permissions`                                 |
|    🔴    | `module.ci-tester["http-redirect"].aws_iam_role.role-tester`                                        |
|    🔴    | `module.ci-tester["http-redirect"].aws_iam_role_policy_attachment.role-admin-permissions[0]`        |
|    🔴    | `module.ci-tester["http-redirect"].aws_iam_role_policy_attachment.role-permissions`                 |
|    🔴    | `module.ci-tester["http-redirect"].aws_iam_role_policy_attachment.role-pytest-permissions`          |
<details>
<summary>STDOUT</summary>

```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # module.ci-tester["http-redirect"].aws_iam_policy.pytest-permissions will be destroyed
  # (because module.ci-tester["http-redirect"] is not in configuration)
  - resource "aws_iam_policy" "pytest-permissions" {
      - arn              = "arn:aws:iam::303467602807:policy/pytest-permissions20250711170255621200000002" -> null
      - attachment_count = 1 -> null
      - id               = "arn:aws:iam::303467602807:policy/pytest-permissions20250711170255621200000002" -> null
      - name             = "pytest-permissions20250711170255621200000002" -> null
      - name_prefix      = "pytest-permissions" -> null
      - path             = "/" -> null
      - policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "s3:PutBucketTagging",
                          - "s3:GetBucketTagging",
                          - "iam:TagRole",
                          - "iam:TagPolicy",
                          - "ec2:DescribeRegions",
                          - "dynamodb:TagResource",
                          - "dynamodb:ListTagsOfResource",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - policy_id        = "ANPAUNKAUEN3TEHCQ4JRM" -> null
      - tags             = {} -> null
      - tags_all         = {
          - "created_by" = "infrahouse/aws-control-303467602807"
        } -> null
        # (1 unchanged attribute hidden)
    }

  # module.ci-tester["http-redirect"].aws_iam_policy.role-permissions will be destroyed
  # (because module.ci-tester["http-redirect"] is not in configuration)
  - resource "aws_iam_policy" "role-permissions" {
      - arn              = "arn:aws:iam::303467602807:policy/http-redirect-permissions20250711170255618800000001" -> null
      - attachment_count = 1 -> null
      - id               = "arn:aws:iam::303467602807:policy/http-redirect-permissions20250711170255618800000001" -> null
      - name             = "http-redirect-permissions20250711170255618800000001" -> null
      - name_prefix      = "http-redirect-permissions" -> null
      - path             = "/" -> null
      - policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "sts:GetCallerIdentity"
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - policy_id        = "ANPAUNKAUEN33ORGXGHU7" -> null
      - tags             = {} -> null
      - tags_all         = {
          - "created_by" = "infrahouse/aws-control-303467602807"
        } -> null
        # (1 unchanged attribute hidden)
    }

  # module.ci-tester["http-redirect"].aws_iam_role.role-tester will be destroyed
  # (because module.ci-tester["http-redirect"] is not in configuration)
  - resource "aws_iam_role" "role-tester" {
      - arn                   = "arn:aws:iam::303467602807:role/http-redirect" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::990466748045:user/aleks"
                        }
                    },
                  - {
                      - Action    = "sts:AssumeRole"
                      - Condition = {
                          - ArnEquals = {
                              - "aws:PrincipalArn" = "arn:aws:iam::303467602807:role/http-redirect"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::303467602807:root"
                        }
                    },
                  - {
                      - Action    = "sts:AssumeRoleWithWebIdentity"
                      - Condition = {
                          - StringEquals = {
                              - "token.actions.githubusercontent.com:aud" = "sts.amazonaws.com"
                            }
                          - StringLike   = {
                              - "token.actions.githubusercontent.com:sub" = "repo:infrahouse/terraform-aws-http-redirect:*"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Federated = "arn:aws:iam::303467602807:oidc-provider/token.actions.githubusercontent.com"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2025-07-11T17:02:55Z" -> null
      - description           = "Role to test module infrahouse/terraform-aws-http-redirect" -> null
      - force_detach_policies = false -> null
      - id                    = "http-redirect" -> null
      - managed_policy_arns   = [
          - "arn:aws:iam::303467602807:policy/http-redirect-permissions20250711170255618800000001",
          - "arn:aws:iam::303467602807:policy/pytest-permissions20250711170255621200000002",
          - "arn:aws:iam::aws:policy/AdministratorAccess",
        ] -> null
      - max_session_duration  = 43200 -> null
      - name                  = "http-redirect" -> null
      - path                  = "/" -> null
      - tags                  = {} -> null
      - tags_all              = {
          - "created_by" = "infrahouse/aws-control-303467602807"
        } -> null
      - unique_id             = "AROAUNKAUEN37S3JTI7TT" -> null
        # (2 unchanged attributes hidden)
    }

  # module.ci-tester["http-redirect"].aws_iam_role_policy_attachment.role-admin-permissions[0] will be destroyed
  # (because module.ci-tester["http-redirect"] is not in configuration)
  - resource "aws_iam_role_policy_attachment" "role-admin-permissions" {
      - id         = "http-redirect-20250711170255952600000004" -> null
      - policy_arn = "arn:aws:iam::aws:policy/AdministratorAccess" -> null
      - role       = "http-redirect" -> null
    }

  # module.ci-tester["http-redirect"].aws_iam_role_policy_attachment.role-permissions will be destroyed
  # (because module.ci-tester["http-redirect"] is not in configuration)
  - resource "aws_iam_role_policy_attachment" "role-permissions" {
      - id         = "http-redirect-20250711170255948900000003" -> null
      - policy_arn = "arn:aws:iam::303467602807:policy/http-redirect-permissions20250711170255618800000001" -> null
      - role       = "http-redirect" -> null
    }

  # module.ci-tester["http-redirect"].aws_iam_role_policy_attachment.role-pytest-permissions will be destroyed
  # (because module.ci-tester["http-redirect"] is not in configuration)
  - resource "aws_iam_role_policy_attachment" "role-pytest-permissions" {
      - id         = "http-redirect-20250711170255956800000005" -> null
      - policy_arn = "arn:aws:iam::303467602807:policy/pytest-permissions20250711170255621200000002" -> null
      - role       = "http-redirect" -> null
    }

  # module.ci-tester["http-redirect-tester"].aws_iam_policy.pytest-permissions will be created
  + resource "aws_iam_policy" "pytest-permissions" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = (known after apply)
      + name_prefix      = "pytest-permissions"
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:PutBucketTagging",
                          + "s3:GetBucketTagging",
                          + "iam:TagRole",
                          + "iam:TagPolicy",
                          + "ec2:DescribeRegions",
                          + "dynamodb:TagResource",
                          + "dynamodb:ListTagsOfResource",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = {
          + "created_by" = "infrahouse/aws-control-303467602807"
        }
    }

  # module.ci-tester["http-redirect-tester"].aws_iam_policy.role-permissions will be created
  + resource "aws_iam_policy" "role-permissions" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = (known after apply)
      + name_prefix      = "http-redirect-tester-permissions"
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "sts:GetCallerIdentity"
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = {
          + "created_by" = "infrahouse/aws-control-303467602807"
        }
    }

  # module.ci-tester["http-redirect-tester"].aws_iam_role.role-tester will be created
  + resource "aws_iam_role" "role-tester" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::990466748045:user/aleks"
                        }
                    },
                  + {
                      + Action    = "sts:AssumeRole"
                      + Condition = {
                          + ArnEquals = {
                              + "aws:PrincipalArn" = "arn:aws:iam::303467602807:role/http-redirect-tester"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::303467602807:root"
                        }
                    },
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringEquals = {
                              + "token.actions.githubusercontent.com:aud" = "sts.amazonaws.com"
                            }
                          + StringLike   = {
                              + "token.actions.githubusercontent.com:sub" = "repo:infrahouse/terraform-aws-http-redirect:*"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::303467602807:oidc-provider/token.actions.githubusercontent.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "Role to test module infrahouse/terraform-aws-http-redirect"
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 43200
      + name                  = "http-redirect-tester"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "created_by" = "infrahouse/aws-control-303467602807"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.ci-tester["http-redirect-tester"].aws_iam_role_policy_attachment.role-admin-permissions[0] will be created
  + resource "aws_iam_role_policy_attachment" "role-admin-permissions" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AdministratorAccess"
      + role       = "http-redirect-tester"
    }

  # module.ci-tester["http-redirect-tester"].aws_iam_role_policy_attachment.role-permissions will be created
  + resource "aws_iam_role_policy_attachment" "role-permissions" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "http-redirect-tester"
    }

  # module.ci-tester["http-redirect-tester"].aws_iam_role_policy_attachment.role-pytest-permissions will be created
  + resource "aws_iam_role_policy_attachment" "role-pytest-permissions" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "http-redirect-tester"
    }

Plan: 6 to add, 0 to change, 6 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan"
```
</details>
<details><summary><i>metadata</i></summary>

```
eyJzMzovL2luZnJhaG91c2UtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3L3RlcnJhZm9ybS50ZnN0YXRlIjogeyJzdWNjZXNzIjogdHJ1ZSwgImFkZCI6IDYsICJjaGFuZ2UiOiAwLCAiZGVzdHJveSI6IDZ9fQ==
```
</details>